Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: A disadvantage of this approach is that it doesn't provide a way to restrict the types of objects that can be assigned to the Python attributes. We expect the first and last names to be strings, but any Python objects can be assigned. Further, the attributes can be deleted, setting the C pointers to *NULL*. Even though we can make sure the members are initialized to non-*NULL* values, the members can be set to *NULL* if the attributes are deleted.
pl: Wadą tego podejścia jest to, że nie dostarcza ono sposobu aby ograniczyć rodzaje przedmiotów, które można przypisywać do "własności" języka pytonowskiego. Oczekujemy że imię i nazwisko będą ciągami znaków, ale wszystkie przedmioty języka pytonowskiego mogą być przypisywane. Dalej własności mogą być usunięte, ustawiając wskaźniki C na *NULL*. Nawet chociaż możemy się upewnić, że członki są inicjowane na niepuste (z ang. - non-*NULL*) wartości, członki mogą być ustawione na *NULL* jeśli własności będą kasowane.

source: We define a single method, :meth:`name`, that outputs the objects name as the concatenation of the first and last names. ::
pl: Określamy pojedynczy sposób postępowania, :meth:`name`, która wystawia nazwę przedmiotów jako sklejenia imienia i nazwiska. ::

source: static PyObject * Noddy_name(Noddy* self) { static PyObject *format = NULL; PyObject *args, *result; if (format == NULL) { format = PyString_FromString("%s %s"); if (format == NULL) return NULL; } if (self->first == NULL) { PyErr_SetString(PyExc_AttributeError, "first"); return NULL; } if (self->last == NULL) { PyErr_SetString(PyExc_AttributeError, "last"); return NULL; } args = Py_BuildValue("OO", self->first, self->last); if (args == NULL) return NULL; result = PyString_Format(format, args); Py_DECREF(args); return result; }
pl: static PyObject * Noddy_name(Noddy* self) { static PyObject *format = NULL; PyObject *args, *result; if (format == NULL) { format = PyString_FromString("%s %s"); if (format == NULL) return NULL; } if (self->imie == NULL) { PyErr_SetString(PyExc_AttributeError, "imie"); return NULL; } if (self->last == NULL) { PyErr_SetString(PyExc_AttributeError, "nazwisko"); return NULL; } args = Py_BuildValue("OO", self->imie, self->nazwisko); if (args == NULL) return NULL; result = PyString_Format(format, args); Py_DECREF(args); return result; }

source: The method is implemented as a C function that takes a :class:`Noddy` (or :class:`Noddy` subclass) instance as the first argument. Methods always take an instance as the first argument. Methods often take positional and keyword arguments as well, but in this cased we don't take any and don't need to accept a positional argument tuple or keyword argument dictionary. This method is equivalent to the Python method::
pl: Sposób postępowania jest wypełniony jako zadanie C które przyjmuje przykład uogólnienia :class:`Noddy` (lub podrzędnego uogólnienia względem uogólnienia :class:`Noddy`) jako pierwszy parametr. Sposoby postępowania zawsze przyjmują przykład jako pierwszy argument. Sposoby postępowania często przyjmują pozycyjne jak i kluczowe parametry zarówno, ale w tym przypadku nie pobieramy żadnych i nie potrzebujemy akceptować pozycyjne parametry krotki pozycyjne lub parametrów słów kluczowych słownika. Ten sposób postępowania jest równoważny sposobowi postępowania języka pytonowskiego::

source: def name(self): return "%s %s" % (self.first, self.last)
pl: def name(self): return "%s %s" % (self.imie, self.nazwisko)

source: Note that we have to check for the possibility that our :attr:`first` and :attr:`last` members are *NULL*. This is because they can be deleted, in which case they are set to *NULL*. It would be better to prevent deletion of these attributes and to restrict the attribute values to be strings. We'll see how to do that in the next section.
pl: Zauważ, że musimy sprawdzić możliwość, że nasze własności :attr:`imie` i :attr:`nazwisko` są puste - z ang. - *NULL*. To jest dlatego że mogą być one skasowane, w którym przypadku zostaną one ustawione na *NULL*. Lepiej byłoby zapobiec skasowaniu tych własności i ograniczyć wartości właściwości aby były ciągami znaków. Zobaczymy jak to zrobić w następnym rozdziale.

source: Now that we've defined the method, we need to create an array of method definitions::
pl: Teraz gdy określiliśmy sposób postępowania, musimy stworzyć tabelę definicji sposobów postępowania::

source: static PyMethodDef Noddy_methods[] = { {"name", (PyCFunction)Noddy_name, METH_NOARGS, "Return the name, combining the first and last name" }, {NULL} /* Sentinel */ };
pl: static PyMethodDef Noddy_methods[] = { {"name", (PyCFunction)Noddy_name, METH_NOARGS, "Zwróć nazwę, łącząc imię i nazwisko" }, {NULL} /* Ochrona */ };

source: and assign them to the :attr:`tp_methods` slot::
pl: i przypisz je do gniazda :attr:`tp_methods`::

source: Note that we used the :const:`METH_NOARGS` flag to indicate that the method is passed no arguments.
pl: Zauważ, że używaliśmy flagi :const:`METH_NOARGS` aby wskazać który sposób postępowania nie dostaje żadnych parametrów.

source: Finally, we'll make our type usable as a base class. We've written our methods carefully so far so that they don't make any assumptions about the type of the object being created or used, so all we need to do is to add the :const:`Py_TPFLAGS_BASETYPE` to our class flag definition::
pl: Ostatecznie czynimy nasz typ użytecznym jako uogólnienie bazowe. Napisaliśmy nasze sposoby postępowania uważnie tak że nie czynią one żadnych założeń o rodzaju przedmiotu który jest utworzony lub użyty, więc wszystko, co musimy uczynić to dodać :const:`Py_TPFLAGS_BASETYPE` do naszej definicji flag uogólnienia::

source: We rename :cfunc:`PyInit_noddy` to :cfunc:`PyInit_noddy2` and update the module name in the :ctype:`PyModuleDef` struct.
pl: Zmieniamy nazwę :cfunc:`PyInit_noddy` na :cfunc:`PyInit_noddy2` i uaktualnić nazwę modułu w strukturze :ctype:`PyModuleDef`

source: Finally, we update our :file:`setup.py` file to build the new module::
pl: Ostatecznie uaktualniamy nasz plik :file:`setup.py` do budowania nowego modułu::

source: Providing finer control over data attributes
pl: Dostarczając dokładniejszej kontroli ponad własnościami danych

source: In this section, we'll provide finer control over how the :attr:`first` and :attr:`last` attributes are set in the :class:`Noddy` example. In the previous version of our module, the instance variables :attr:`first` and :attr:`last` could be set to non-string values or even deleted. We want to make sure that these attributes always contain strings.
pl: W tym rozdziale, dostarczymy dokładniejszej kontroli ponad tym jak własności :attr:`imie` i :attr:`nazwisko` są ustawiane w przykładzie :class:`Noddy`. W poprzedniej wersji naszego modułu, zmienne przykładu :attr:`imie` i :attr:`nazwisko` mogły być ustawione na wartości nie-ciągu-znaków lub nawet skasowane. Chcemy się upewnić że te własności zawsze zawierają ciągi znaków.

source: #include <Python.h> #include "structmember.h" typedef struct { PyObject_HEAD PyObject *first; PyObject *last; int number; } Noddy; static void Noddy_dealloc(Noddy* self) { Py_XDECREF(self->first); Py_XDECREF(self->last); Py_TYPE(self)->tp_free((PyObject*)self); } static PyObject * Noddy_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { Noddy *self; self = (Noddy *)type->tp_alloc(type, 0); if (self != NULL) { self->first = PyUnicode_FromString(""); if (self->first == NULL) { Py_DECREF(self); return NULL; } self->last = PyUnicode_FromString(""); if (self->last == NULL) { Py_DECREF(self); return NULL; } self->number = 0; } return (PyObject *)self; } static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *first=NULL, *last=NULL, *tmp; static char *kwlist[] = {"first", "last", "number", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|SSi", kwlist, &first, &last, &self->number)) return -1; if (first) { tmp = self->first; Py_INCREF(first); self->first = first; Py_DECREF(tmp); } if (last) { tmp = self->last; Py_INCREF(last); self->last = last; Py_DECREF(tmp); } return 0; } static PyMemberDef Noddy_members[] = { {"number", T_INT, offsetof(Noddy, number), 0, "noddy number"}, {NULL} /* Sentinel */ }; static PyObject * Noddy_getfirst(Noddy *self, void *closure) { Py_INCREF(self->first); return self->first; } static int Noddy_setfirst(Noddy *self, PyObject *value, void *closure) { if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Cannot delete the first attribute"); return -1; } if (! PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "The first attribute value must be a string"); return -1; } Py_DECREF(self->first); Py_INCREF(value); self->first = value; return 0; } static PyObject * Noddy_getlast(Noddy *self, void *closure) { Py_INCREF(self->last); return self->last; } static int Noddy_setlast(Noddy *self, PyObject *value, void *closure) { if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Cannot delete the last attribute"); return -1; } if (! PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "The last attribute value must be a string"); return -1; } Py_DECREF(self->last); Py_INCREF(value); self->last = value; return 0; } static PyGetSetDef Noddy_getseters[] = { {"first", (getter)Noddy_getfirst, (setter)Noddy_setfirst, "first name", NULL}, {"last", (getter)Noddy_getlast, (setter)Noddy_setlast, "last name", NULL}, {NULL} /* Sentinel */ }; static PyObject * Noddy_name(Noddy* self) { static PyObject *format = NULL; PyObject *args, *result; if (format == NULL) { format = PyUnicode_FromString("%s %s"); if (format == NULL) return NULL; } args = Py_BuildValue("OO", self->first, self->last); if (args == NULL) return NULL; result = PyUnicode_Format(format, args); Py_DECREF(args); return result; } static PyMethodDef Noddy_methods[] = { {"name", (PyCFunction)Noddy_name, METH_NOARGS, "Return the name, combining the first and last name" }, {NULL} /* Sentinel */ }; static PyTypeObject NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(Noddy), /* tp_basicsize */ 0, /* tp_itemsize */ (destructor)Noddy_dealloc, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, /* tp_flags */ "Noddy objects", /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ Noddy_methods, /* tp_methods */ Noddy_members, /* tp_members */ Noddy_getseters, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ (initproc)Noddy_init, /* tp_init */ 0, /* tp_alloc */ Noddy_new, /* tp_new */ }; static PyModuleDef noddy3module = { PyModuleDef_HEAD_INIT, "noddy3", "Example module that creates an extension type.", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_noddy3(void) { PyObject* m; if (PyType_Ready(&NoddyType) < 0) return NULL; m = PyModule_Create(&noddy3module); if (m == NULL) return NULL; Py_INCREF(&NoddyType); PyModule_AddObject(m, "Noddy", (PyObject *)&NoddyType); return m; }
pl: #include <Python.h> #include "structmember.h" typedef struct { PyObject_HEAD PyObject *imie; PyObject *nazwisko; int numer; } Noddy; static void Noddy_dealloc(Noddy* self) { Py_XDECREF(self->imie); Py_XDECREF(self->nazwisko); Py_TYPE(self)->tp_free((PyObject*)self); } static PyObject * Noddy_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { Noddy *self; self = (Noddy *)type->tp_alloc(type, 0); if (self != NULL) { self->imie = PyUnicode_FromString(""); if (self->imie == NULL) { Py_DECREF(self); return NULL; } self->nazwisko = PyUnicode_FromString(""); if (self->nazwisko == NULL) { Py_DECREF(self); return NULL; } self->numer = 0; } return (PyObject *)self; } static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *imie=NULL, *nazwisko=NULL, *tmp; static char *kwlist[] = {"imie", "nazwisko", "numer", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|SSi", kwlist, &imie, &nazwisko, &self->numer)) return -1; if (imie) { tmp = self->imie; Py_INCREF(imie); self->imie = imie; Py_DECREF(tmp); } if (nazwisko) { tmp = self->nazwisko; Py_INCREF(nazwisko); self->nazwisko = nazwisko; Py_DECREF(tmp); } return 0; } static PyMemberDef Noddy_members[] = { {"numer", T_INT, offsetof(Noddy, numer), 0, "noddy numer"}, {NULL} /* Ochrona */ }; static PyObject * Noddy_getfirst(Noddy *self, void *closure) { Py_INCREF(self->imie); return self->imie; } static int Noddy_setimie(Noddy *self, PyObject *value, void *closure) { if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Nie można usunąć właściwości imienia"); return -1; } if (! PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "Wartość własności imienia musi być ciągiem znaków"); return -1; } Py_DECREF(self->imie); Py_INCREF(value); self->imie = value; return 0; } static PyObject * Noddy_getlast(Noddy *self, void *closure) { Py_INCREF(self->nazwisko); return self->nazwisko; } static int Noddy_setnazwisko(Noddy *self, PyObject *value, void *closure) { if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Nie można usunąć własności nazwiska"); return -1; } if (! PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "Wartość własności nazwiska musi być ciągiem znaków"); return -1; } Py_DECREF(self->nazwisko); Py_INCREF(value); self->nazwisko = value; return 0; } static PyGetSetDef Noddy_getseters[] = { {"imie", (getter)Noddy_getimie, (setter)Noddy_setimie, "imię", NULL}, {"nazwisko", (getter)Noddy_getnazwisko, (setter)Noddy_setnazwisko, "nazwisko", NULL}, {NULL} /* Ochrona */ }; static PyObject * Noddy_name(Noddy* self) { static PyObject *format = NULL; PyObject *args, *result; if (format == NULL) { format = PyUnicode_FromString("%s %s"); if (format == NULL) return NULL; } args = Py_BuildValue("OO", self->imie, self->nazwisko); if (args == NULL) return NULL; result = PyUnicode_Format(format, args); Py_DECREF(args); return result; } static PyMethodDef Noddy_methods[] = { {"nazwa", (PyCFunction)Noddy_nazwa, METH_NOARGS, "Zwróć nazwisko, łącząc imię i nazwisko" }, {NULL} /* Ochrona */ }; static PyTypeObject NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(Noddy), /* tp_basicsize */ 0, /* tp_itemsize */ (destructor)Noddy_dealloc, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, /* tp_flags */ "przedmioty Noddy", /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ Noddy_methods, /* tp_methods */ Noddy_members, /* tp_members */ Noddy_getseters, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ (initproc)Noddy_init, /* tp_init */ 0, /* tp_alloc */ Noddy_new, /* tp_new */ }; static PyModuleDef noddy3module = { PyModuleDef_HEAD_INIT, "noddy3", "Przykładowy moduł który tworzy typ rozszerzający.", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_noddy3(void) { PyObject* m; if (PyType_Ready(&NoddyType) < 0) return NULL; m = PyModule_Create(&noddy3module); if (m == NULL) return NULL; Py_INCREF(&NoddyType); PyModule_AddObject(m, "Noddy", (PyObject *)&NoddyType); return m; }

source: To provide greater control, over the :attr:`first` and :attr:`last` attributes, we'll use custom getter and setter functions. Here are the functions for getting and setting the :attr:`first` attribute::
pl: Aby zapewnić większą kontrolę, nad właściwościami :attr:`imie` i :attr:`nazwisko` użyjemy własnych zadań pobrania i ustawiania. Tu są zadania dla pobierania i ustawiania (getter i setter - z ang.) właściwości :attr:`imie`::

source: Noddy_getfirst(Noddy *self, void *closure) { Py_INCREF(self->first); return self->first; } static int Noddy_setfirst(Noddy *self, PyObject *value, void *closure) { if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Cannot delete the first attribute"); return -1; } if (! PyString_Check(value)) { PyErr_SetString(PyExc_TypeError, "The first attribute value must be a string"); return -1; } Py_DECREF(self->first); Py_INCREF(value); self->first = value; return 0; }
pl: Noddy_getimie(Noddy *self, void *closure) { Py_INCREF(self->imie); return self->imie; } static int Noddy_setimie(Noddy *self, PyObject *value, void *closure) { if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Nie można usunąć właściwości imienia"); return -1; } if (! PyString_Check(value)) { PyErr_SetString(PyExc_TypeError, "Wartość pierwszej właściwości musi być ciągiem znaków"); return -1; } Py_DECREF(self->imie); Py_INCREF(value); self->imie = value; return 0; }

source: The getter function is passed a :class:`Noddy` object and a "closure", which is void pointer. In this case, the closure is ignored. (The closure supports an advanced usage in which definition data is passed to the getter and setter. This could, for example, be used to allow a single set of getter and setter functions that decide the attribute to get or set based on data in the closure.)
pl: Zadaniu pobierającemu jest przekazywany przedmiot uogólnienia :class:`Noddy` i "domknięcie" - ang. - "closure", które jest pustym wskaźnikiem. W tym przypadku "domknięcie" jest ignorowane. (domknięcie wspiera zaawansowane użycie w którym dane definicji są przekazywane dla zadania pobierającego i ustawiającego (getter i setter). To mogłoby, dla przykładu, być użyte aby pozwolić pojedynczemu zbiorowi zadań pobierających i ustawiających decydować, że własność będzie wzięta lub ustawiona w oparciu o dane w domknięciu.)

source: The setter function is passed the :class:`Noddy` object, the new value, and the closure. The new value may be *NULL*, in which case the attribute is being deleted. In our setter, we raise an error if the attribute is deleted or if the attribute value is not a string.
pl: Zadaniu ustawiającemu jest przekazywany przedmiot uogólnienia :class:`Noddy`, nowa wartość i domknięcie. Nowa wartość może być *NULL*, w którym to przypadku własność zostanie usunięta. W naszym zadaniu ustawiającym, zgłaszamy błąd jeśli właściwość jest kasowana lub jeśli własność nie jest ciągiem znaków.

source: We create an array of :ctype:`PyGetSetDef` structures::
pl: Tworzymy tabelę struktur :ctype:`PyGetSetDef`::

source: static PyGetSetDef Noddy_getseters[] = { {"first", (getter)Noddy_getfirst, (setter)Noddy_setfirst, "first name", NULL}, {"last", (getter)Noddy_getlast, (setter)Noddy_setlast, "last name", NULL}, {NULL} /* Sentinel */ };
pl: static PyGetSetDef Noddy_getseters[] = { {"imie", (getter)Noddy_getfirst, (setter)Noddy_setfirst, "imię", NULL}, {"nazwisko", (getter)Noddy_getlast, (setter)Noddy_setlast, "nazwisko", NULL}, {NULL} /* Ochrona */ };

source: and register it in the :attr:`tp_getset` slot::
pl: i rejestrujemy je w gnieździe :attr:`tp_getset`::

source: to register our attribute getters and setters.
pl: aby zarejestrować nasze zadania pobierania i ustawiania właściwości.

source: The last item in a :ctype:`PyGetSetDef` structure is the closure mentioned above. In this case, we aren't using the closure, so we just pass *NULL*.
pl: Ostatnim elementem w strukturze :ctype:`PyGetSetDef` jest domknięcie wspomniane powyżej. W tym przypadku, nie używamy domknięcia, więc przekażemy po prostu *NULL*.

source: We also remove the member definitions for these attributes::
pl: Zdejmujemy także definicje członków dla tych własności::

source: static PyMemberDef Noddy_members[] = { {"number", T_INT, offsetof(Noddy, number), 0, "noddy number"}, {NULL} /* Sentinel */ };
pl: static PyMemberDef Noddy_members[] = { {"numer", T_INT, offsetof(Noddy, numer), 0, "noddy numer"}, {NULL} /* Ochrona */ };

source: We also need to update the :attr:`tp_init` handler to only allow strings [#]_ to be passed::
pl: Musimy także uaktualnić obsługę :attr:`tp_init` aby tylko akceptowała ciągi znaków [#]_ aby były przekazywane::

source: static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *first=NULL, *last=NULL, *tmp; static char *kwlist[] = {"first", "last", "number", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|SSi", kwlist, &first, &last, &self->number)) return -1; if (first) { tmp = self->first; Py_INCREF(first); self->first = first; Py_DECREF(tmp); } if (last) { tmp = self->last; Py_INCREF(last); self->last = last; Py_DECREF(tmp); } return 0; }
pl: static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *imie=NULL, *nazwisko=NULL, *tmp; static char *kwlist[] = {"imie", "nazwisko", "numer", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|SSi", kwlist, &imie, &nazwisko, &self->numer)) return -1; if (imie) { tmp = self->imie; Py_INCREF(imie); self->imie = imie; Py_DECREF(tmp); } if (nazwisko) { tmp = self->nazwisko; Py_INCREF(nazwisko); self->nazwisko = nazwisko; Py_DECREF(tmp); } return 0; }

source: With these changes, we can assure that the :attr:`first` and :attr:`last` members are never *NULL* so we can remove checks for *NULL* values in almost all cases. This means that most of the :cfunc:`Py_XDECREF` calls can be converted to :cfunc:`Py_DECREF` calls. The only place we can't change these calls is in the deallocator, where there is the possibility that the initialization of these members failed in the constructor.
pl: Z tymi zmianami, możemy zapewnić, że członki :attr:`imie` i :attr:`nazwisko` nigdy nie są *NULL* więc możemy zdjąć sprawdzenia wartości *NULL* w większości przypadków. To oznacza, że większość z wywołań :cfunc:`Py_XDECREF` może być zamienionych na wywołania :cfunc:`Py_DECREF`. Jedynym miejscem w którym nie możemy zmienić tych wywołań jest dealokator, gdzie istnieje możliwość, że inicjacja tych członków zawiodła w konstruktorze.

source: We also rename the module initialization function and module name in the initialization function, as we did before, and we add an extra definition to the :file:`setup.py` file.
pl: Zmieniamy także zadanie inicjujące moduł i nazwę modułu w zadaniu inicjującym, tak jak poprzednio, i dodajemy dodatkową definicję do pliku :file:`setup.py`.

source: Supporting cyclic garbage collection
pl: Wsparcie dla cyklicznej zbiórki śmieci.

source: Python has a cyclic-garbage collector that can identify unneeded objects even when their reference counts are not zero. This can happen when objects are involved in cycles. For example, consider::
pl: Język pytonowski ma cykliczną zbiórkę śmieci, która może identyfikować niepotrzebne przedmioty nawet gdy ich liczby odniesień nie są równe zero. To może się zdarzyć gdy przedmioty odnoszą się do siebie cyklicznie. Na przykład, załóżmy::

source: In this example, we create a list that contains itself. When we delete it, it still has a reference from itself. Its reference count doesn't drop to zero. Fortunately, Python's cyclic-garbage collector will eventually figure out that the list is garbage and free it.
pl: W tym przykładzie, tworzymy listę, która zawiera samą siebie. Gdy kasujemy ją, to wciąż ma ona odniesienie do niej ze środka. Jej liczba odniesień nie spada do zera. Na szczęście cykliczna-zbiórka śmieci języka pytonowskiego ostatecznie że cała lista jest śmieciem i uwolni ją.
